shuai132/BalanceCar/STM32/system/drivers/bluenrg/bluenrg_ms/stm32_bluenrg_ble_dma_lp.c
/**
  ******************************************************************************
  * @file    stm32_bluenrg_ble_dma_lp.c
  * @author  CL
  * @version V1.0.0
  * @date    04-July-2014
  * @brief   
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 
  
/* Includes ------------------------------------------------------------------*/
#include "stm32_bluenrg_ble_dma_lp.h"
#include "hci_const.h"

/** @addtogroup BSP
 *  @{
 */

/** @addtogroup X-NUCLEO-IDB04A1
 *  @{
 */

/** @defgroup STM32_BLUENRG_BLE_DMA_LP
 *  @{
 */

/** @defgroup STM32_BLUENRG_BLE_DMA_LP_Private_Defines 
 *  @{
 */
 
#define TEST_TX_BUFFER_LIMITATION 0
#define MAX_TX_BUFFER_SIZE 0x7F
#define BLUENRG_READY_STATE 0x02

#define HEADER_SIZE 5
#define MAX_BUFFER_SIZE 255

/**
 * @}
 */
 
/** @defgroup STM32_BLUENRG_BLE_DMA_LP_Private_Types
* @{
*/ 

typedef enum
{
  SPI_HEADER_TRANSMIT,
  SPI_PAYLOAD_TRANSMIT
} SPI_TRANSMIT_REQUEST_t;

typedef enum
{
  SPI_HEADER_TRANSMITTED,
  SPI_PAYLOAD_TRANSMITTED
} SPI_TRANSMIT_EVENT_t;

typedef enum
{
  SPI_REQUEST_VALID_HEADER_FOR_RX,
  SPI_REQUEST_VALID_HEADER_FOR_TX,
  SPI_REQUEST_PAYLOAD
} SPI_RECEIVE_REQUEST_t;

typedef enum
{
  SPI_CHECK_RECEIVED_HEADER_FOR_RX,
  SPI_CHECK_RECEIVED_HEADER_FOR_TX,
  SPI_RECEIVE_END
} SPI_RECEIVE_EVENT_t;

typedef enum
{
  SPI_AVAILABLE,
  SPI_BUSY
} SPI_PERIPHERAL_STATUS_t;

typedef struct
{
  SPI_TRANSMIT_EVENT_t Spi_Transmit_Event;
  uint8_t* header_data;
  uint8_t* payload_data;
  uint8_t header_size;
  uint8_t payload_size;
  uint8_t payload_size_to_transmit;
  uint8_t packet_cont;
  uint8_t RequestPending;
} SPI_Transmit_Context_t;

typedef struct
{
  SPI_RECEIVE_EVENT_t Spi_Receive_Event;
  uint16_t payload_len;
  uint8_t* buffer;
  uint8_t buffer_size;
} SPI_Receive_Context_t;

typedef struct
{
  SPI_HandleTypeDef *hspi;
  SPI_PERIPHERAL_STATUS_t Spi_Peripheral_State;
  SPI_Receive_Context_t SPI_Receive_Context;
  SPI_Transmit_Context_t SPI_Transmit_Context;
} SPI_Context_t;

/**
 * @}
 */

/** @defgroup STM32_BLUENRG_BLE_DMA_LP_Private_Variables
 * @{
 */

SPI_HandleTypeDef SpiHandle;
SPI_Context_t SPI_Context;

const uint8_t Write_Header_CMD[HEADER_SIZE] = {0x0a, 0x00, 0x00, 0x00, 0x00};
const uint8_t Read_Header_CMD[HEADER_SIZE] = {0x0b, 0x00, 0x00, 0x00, 0x00};
const uint8_t dummy_bytes = 0xFF;

uint8_t Received_Header[HEADER_SIZE];

#ifdef ENABLE_SPI_FIX
static uint8_t StartupTimerId;
#endif
static uint8_t TxRxTimerId;
volatile uint8_t ubnRFresetTimerLock;
pf_TIMER_TimerCallBack_t pTimerTxRxCallback;

/**
 * @}
 */

/** @defgroup STM32_BLUENRG_BLE_DMA_LP_Extern_Variables
 * @{
 */
extern uint8_t* HCI_read_packet;

/**
 * @}
 */

/** @defgroup STM32_BLUENRG_BLE_DMA_LP_Private_Function_Prototypes 
 *  @{
 */
 
/* Private function prototypes -----------------------------------------------*/
static void SPI_Transmit_Manager(SPI_TRANSMIT_REQUEST_t TransmitRequest);
static void SPI_Receive_Manager(SPI_RECEIVE_REQUEST_t ReceiveRequest);
static void set_irq_as_output(void);
static void set_irq_as_input(void);
static void Disable_SPI_Receiving_Path(void);
static void Enable_SPI_Receiving_Path(void);
static void Enable_SPI_CS(void);
static void Disable_SPI_CS(void);
static void DisableEnable_SPI_CS(void);
static void TransmitClosure(void);
static void ReceiveClosure(void);
static void ReceiveHeader(SPI_RECEIVE_EVENT_t ReceiveEvent, uint8_t * DataHeader);
static void WakeupBlueNRG(void);
static void TimerStartupCallback(void);
static void TimerTransmitCallback(void);
static void pf_nRFResetTimerCallBack(void);
static void TimerTxRxCallback(void);
static void ProcessEndOfReceive(void);

/**
 * @}
 */

/** @defgroup STM32_BLUENRG_BLE_DMA_LP_Exported_Functions 
 * @{
 */ 
 
/**
 * @brief  This function notify when then BlueNRG nRESET may be released
 * @param  None
 * @retval None
 */
static void pf_nRFResetTimerCallBack(void)
{
  ubnRFresetTimerLock = 0;
  
  return;
}

/**
 * @brief  Timer callback to handle RxTx Timers
 * @param  None
 * @retval None
 */
static void TimerTxRxCallback(void)
{
  pTimerTxRxCallback();
  
  return;
}

/**
 * @brief  Close the receiver path
 * @param  None
 * @retval None
 */
static void ReceiveClosure(void)
{
  /*
   *  Disable both DMA
   */
  __HAL_DMA_DISABLE(SPI_Context.hspi->hdmatx);
  __HAL_DMA_DISABLE(SPI_Context.hspi->hdmarx);
  
