shuai132/BalanceCar/STM32/system/drivers/bluenrg/bluenrg_ms/stm32_bluenrg_ble_dma_lp.c
  /*
   * Check if a command is pending
   */
  __disable_irq();
  if(SPI_Context.SPI_Transmit_Context.RequestPending == TRUE)
  {
    SPI_Context.SPI_Transmit_Context.RequestPending = FALSE;
    SPI_Context.Spi_Peripheral_State = SPI_BUSY;
    Disable_SPI_Receiving_Path();
    __enable_irq();
    WakeupBlueNRG();
  }
  else
  {
    SPI_Context.Spi_Peripheral_State = SPI_AVAILABLE;
    __enable_irq();
  }
  
  return;
}

/**
 * @brief  Delay Notification to the App to prevent dummy event read
 * @param  None
 * @retval None
 */
static void ProcessEndOfReceive(void)
{
  ReceiveClosure();
  
  HCI_Isr(HCI_read_packet, SPI_Context.SPI_Receive_Context.payload_len);
  
  return;
}

/**
 * @brief  Timer callback to apply timeout SPI FIX
 * @param  None
 * @retval None
 */
static void TimerTransmitCallback(void)
{
  SPI_Receive_Manager(SPI_REQUEST_VALID_HEADER_FOR_TX);	/**< BlueNRG not ready for writing */
  LPM_Mode_Request(eLPM_SPI_TX, eLPM_Mode_Sleep);
  
  return;
}

/**
 * @brief  Closes the SPI when BLE is disabled by the application
 * 		   Releases allocated resources
 * @param  None
 * @retval None
 */
void BNRG_SPI_Close(void)
{
#ifdef ENABLE_SPI_FIX
  TIMER_Delete(StartupTimerId);
#endif
  TIMER_Delete(TxRxTimerId);
  
  return;
}

/**
 * @brief  Initializes the SPI communication with the BlueNRG Shield.
 * @param  None
 * @retval None
 */
void BNRG_SPI_Init(void)
{
  BNRG_MSP_SPI_Init(&SpiHandle);
  
  SPI_Context.hspi = &SpiHandle;  
  
  SPI_Context.Spi_Peripheral_State = SPI_AVAILABLE;
  SPI_Context.SPI_Transmit_Context.RequestPending = FALSE;
  
  __HAL_BLUENRG_SPI_ENABLE_DMAREQ(&SpiHandle, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
  
  __HAL_SPI_ENABLE(&SpiHandle);

#ifdef ENABLE_SPI_FIX
  TIMER_Create(eTimerModuleID_Interrupt, &StartupTimerId, eTimerMode_SingleShot, TimerStartupCallback);
#endif
  TIMER_Create(eTimerModuleID_Interrupt, &TxRxTimerId, eTimerMode_SingleShot, TimerTxRxCallback);
  return;
}

/**
 * @brief  Initializes the SPI communication with the BlueNRG Shield
 * @param  None
 * @retval None
 */
void BNRG_MSP_SPI_Init(SPI_HandleTypeDef * hspi)
{
  hspi->Instance = BNRG_SPI_INSTANCE;
  hspi->Init.Mode = BNRG_SPI_MODE;
  hspi->Init.Direction = BNRG_SPI_DIRECTION;
  hspi->Init.DataSize = BNRG_SPI_DATASIZE;
  hspi->Init.CLKPolarity = BNRG_SPI_CLKPOLARITY;
  hspi->Init.CLKPhase = BNRG_SPI_CLKPHASE;
  hspi->Init.NSS = BNRG_SPI_NSS;
  hspi->Init.FirstBit = BNRG_SPI_FIRSTBIT;
  hspi->Init.TIMode = BNRG_SPI_TIMODE;
  hspi->Init.CRCPolynomial = BNRG_SPI_CRCPOLYNOMIAL;
  hspi->Init.BaudRatePrescaler = BNRG_SPI_BAUDRATEPRESCALER;
  hspi->Init.CRCCalculation = BNRG_SPI_CRCCALCULATION;

  HAL_SPI_Init(hspi);

  return;
}

/**
 * @brief  Resets the BlueNRG.
 * @param  None
 * @retval None
 */
void BlueNRG_RST(void)
{
  uint8_t ubnRFResetTimerID;
  
  GPIO_InitTypeDef GPIO_InitStruct;
  
  GPIO_InitStruct.Pin = BNRG_SPI_RESET_PIN;
  GPIO_InitStruct.Speed = BNRG_SPI_RESET_SPEED;
  TIMER_Create(eTimerModuleID_Interrupt, &ubnRFResetTimerID, eTimerMode_SingleShot, pf_nRFResetTimerCallBack);
  
  BNRG_SPI_RESET_CLK_ENABLE();
  
  HAL_GPIO_WritePin(BNRG_SPI_RESET_PORT, BNRG_SPI_RESET_PIN, GPIO_PIN_RESET);
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);
  
  TIMER_Start(ubnRFResetTimerID, BLUENRG_HOLD_TIME_IN_RESET);
  ubnRFresetTimerLock = 1;
  while(ubnRFresetTimerLock == 1);
  
  HAL_GPIO_WritePin(BNRG_SPI_RESET_PORT, BNRG_SPI_RESET_PIN, GPIO_PIN_SET);
  
#if 1
  /*
   * Limitation in HAL V1.1.0
   * The HAL_GPIO_Init() is first configuring the Mode of the IO before the Pull UP configuration
   * To avoid glitch on the IO, the configuration shall go through an extra step OUTPUT/PULLUP
   * to set upfront the PULL UP configuration.
   */
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);
#endif
  
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);
  
  TIMER_Start(ubnRFResetTimerID, BLUENRG_HOLD_TIME_AFTER_RESET);
  ubnRFresetTimerLock = 1;
  while(ubnRFresetTimerLock == 1);
  TIMER_Delete(ubnRFResetTimerID);
  
  return;
}

/**
 * @brief  Writes data from local buffer to SPI.
 * @param  hspi: SPI handle
 * @param  header_data: First data buffer to be written
 * @param  payload_data: Second data buffer to be written
 * @param  header_size: Size of first data buffer to be written
 * @param  payload_size: Size of second data buffer to be written
 * @retval Number of read bytes
 */
void BlueNRG_SPI_Write(uint8_t* header_data, uint8_t* payload_data, uint8_t header_size, uint8_t payload_size)
{  
  SPI_Context.SPI_Transmit_Context.header_data = header_data;
  SPI_Context.SPI_Transmit_Context.payload_data = payload_data;
  SPI_Context.SPI_Transmit_Context.header_size = header_size;
  SPI_Context.SPI_Transmit_Context.payload_size = payload_size;
  
  SPI_Context.SPI_Transmit_Context.packet_cont = FALSE;
  
  __disable_irq();
  if(SPI_Context.Spi_Peripheral_State == SPI_AVAILABLE)
  {
    SPI_Context.Spi_Peripheral_State = SPI_BUSY;
    Disable_SPI_Receiving_Path();
    __enable_irq();
    WakeupBlueNRG();
  }
  else
  {
    SPI_Context.SPI_Transmit_Context.RequestPending = TRUE;
    __enable_irq();
  }
  
  return;
}

/**
 * @brief  Set in Output mode the IRQ.
 * @param  None
 * @retval None
 */
static void set_irq_as_output(void)
{
  HAL_GPIO_WritePin(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN, GPIO_PIN_SET);
  HAL_LPPUART_GPIO_Set_Mode(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN_POSITION, GPIO_MODE_OUTPUT_PP);
  __HAL_GPIO_EXTI_CLEAR_IT(BNRG_SPI_IRQ_PIN);
}

/**
 * @brief  Set the IRQ in input mode.
 * @param  None
 * @retval None
 */
static void set_irq_as_input(void)
{
  HAL_GPIO_WritePin(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN, GPIO_PIN_RESET); // WARNING: it may conflict with BlueNRG driving High
  HAL_LPPUART_GPIO_Set_Mode(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN_POSITION, GPIO_MODE_INPUT);
}

/**
 * @brief  Enable SPI IRQ.
 * @param  None
 * @retval None
 */
static void Enable_SPI_Receiving_Path(void)
{  
  __HAL_GPIO_EXTI_CLEAR_IT(BNRG_SPI_EXTI_PIN);
  HAL_NVIC_ClearPendingIRQ(BNRG_SPI_EXTI_IRQn);
  HAL_NVIC_EnableIRQ(BNRG_SPI_EXTI_IRQn);
  
