shuai132/BalanceCar/STM32/system/drivers/bluenrg/bluenrg_ms/stm32_bluenrg_ble_dma_lp.c
  if (HAL_GPIO_ReadPin(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN) == GPIO_PIN_SET)
  {
    __HAL_GPIO_EXTI_GENERATE_SWIT(BNRG_SPI_IRQ_PIN);
  }
}

/**
 * @brief  Disable SPI IRQ.
 * @param  None
 * @retval None
 */
static void Disable_SPI_Receiving_Path(void)
{  
  HAL_NVIC_DisableIRQ(BNRG_SPI_EXTI_IRQn);
}

/**
 * @brief  Enable SPI CS.
 * @param  None
 * @retval None
 */
static void Enable_SPI_CS(void)
{
  /* CS reset */
  HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_RESET);
}

/**
 * @brief  Disable SPI CS.
 * @param  None
 * @retval None
 */
static void Disable_SPI_CS(void)
{
  while (__HAL_SPI_GET_FLAG(SPI_Context.hspi,SPI_FLAG_BSY) == SET);
  
  /* CS set */
  HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_SET);
}

/**
 * @brief  Disable and Enable SPI CS.
 * @param  None
 * @retval None
 */
static void DisableEnable_SPI_CS(void)
{
  while (__HAL_SPI_GET_FLAG(SPI_Context.hspi,SPI_FLAG_BSY) == SET);
  
  /* CS set */
  HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_SET);
  
  /* CS reset */
  HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_RESET);
}

/**
 * @brief Tx and Rx Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *              the configuration information for SPI module.
 * @retval None
 */
void BlueNRG_DMA_RxCallback(void)
{
  uint16_t byte_count;
  uint8_t ready_state;
  
  __HAL_DMA_CLEAR_FLAG(SPI_Context.hspi->hdmarx, BNRG_SPI_RX_DMA_TC_FLAG);
  
  /**
   * The TCIF shall be cleared to be able to start a new DMA transmission later on when required.
   * When receiving data, the TCIE is not set as there is no need to handle the interrupt
   * handler of the DMA_Tx.
   * The TCIF clearing is mandatory on STM32F4 but not on STM32L0.
   * In order to keep code identical across platform, the TCIF clearing may be kept as well on
   * the STM32L0 and all other MCUs.
   */
  __HAL_DMA_CLEAR_FLAG(SPI_Context.hspi->hdmatx, BNRG_SPI_TX_DMA_TC_FLAG);
  switch (SPI_Context.SPI_Receive_Context.Spi_Receive_Event)
  {
  case SPI_CHECK_RECEIVED_HEADER_FOR_RX:
    byte_count = (Received_Header[4]<<8)|Received_Header[3];
    ready_state = Received_Header[0];
    
    if ((byte_count == 0) || (ready_state != BLUENRG_READY_STATE))
    {
      if (HAL_GPIO_ReadPin(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN) == GPIO_PIN_RESET)
      {
        /**
         * This USE CASE shall never happen as this may break the IRQ/CS specification
         * The IRQ line shall never be low when CS is low to avoid BlueNRG race condition when
         * entering low power mode
         * the SPI_END_RECEIVE_FIX has been implemented to make sure this USE CASE never occurs
         * However, even when the behavior is not compliant to the specification, the BlueNRG
         * may not fail so it is increasing robustness by adding this checking just in case the
         * timeout define in the workaround is too short which will end up to marginally brake
         * the specification.
         * This checking will poping BluenRG for a dummy even
         */
        
        /* Release CS line */
        Disable_SPI_CS();
        
        LPM_Mode_Request(eLPM_SPI_RX, eLPM_Mode_LP_Stop);
        
        ReceiveClosure();
      }
      else
      {
        DisableEnable_SPI_CS();
        SPI_Receive_Manager(SPI_REQUEST_VALID_HEADER_FOR_RX); /**< BlueNRG not ready for reading */
      }
    }
    else
    {
      SPI_Receive_Manager(SPI_REQUEST_PAYLOAD);	/**< BlueNRG is ready for reading */
    }
    break;
    
  case SPI_RECEIVE_END:
    /* Release CS line */
    Disable_SPI_CS();
    
    LPM_Mode_Request(eLPM_SPI_RX, eLPM_Mode_LP_Stop);
    
#if (SPI_END_RECEIVE_FIX == 1)
    pTimerTxRxCallback = ProcessEndOfReceive;
    TIMER_Start(TxRxTimerId, SPI_END_RECEIVE_FIX_TIMEOUT);
#else
    ProcessEndOfReceive();
#endif
    break;
    
  case SPI_CHECK_RECEIVED_HEADER_FOR_TX:
    byte_count = (Received_Header[2]<<8)|Received_Header[1];
    ready_state = Received_Header[0];
    
    if ((byte_count == 0) || (ready_state != BLUENRG_READY_STATE))
    {
      DisableEnable_SPI_CS();
      SPI_Receive_Manager(SPI_REQUEST_VALID_HEADER_FOR_TX);	/**< BlueNRG not ready for writing */
    }
    else
    {
#if (TEST_TX_BUFFER_LIMITATION == 1)
      if(byte_count > MAX_TX_BUFFER_SIZE)
      {
        byte_count = MAX_TX_BUFFER_SIZE;
      }
#endif
      
      if(SPI_Context.SPI_Transmit_Context.packet_cont != TRUE)
      {
        if( byte_count < (SPI_Context.SPI_Transmit_Context.header_size + SPI_Context.SPI_Transmit_Context.payload_size))
        {
          SPI_Context.SPI_Transmit_Context.payload_size_to_transmit = byte_count - SPI_Context.SPI_Transmit_Context.header_size;
          SPI_Context.SPI_Transmit_Context.payload_size -= SPI_Context.SPI_Transmit_Context.payload_size_to_transmit;
          SPI_Context.SPI_Transmit_Context.packet_cont = TRUE;
        }
        else
        {
          SPI_Context.SPI_Transmit_Context.payload_size_to_transmit = SPI_Context.SPI_Transmit_Context.payload_size;
        }
        
        SPI_Transmit_Manager(SPI_HEADER_TRANSMIT);
      }
      else
      {
        if( byte_count < SPI_Context.SPI_Transmit_Context.payload_size)
        {
          SPI_Context.SPI_Transmit_Context.payload_size_to_transmit = byte_count;
          SPI_Context.SPI_Transmit_Context.payload_size -= SPI_Context.SPI_Transmit_Context.payload_size_to_transmit;
        }
        else
        {
          SPI_Context.SPI_Transmit_Context.payload_size_to_transmit = SPI_Context.SPI_Transmit_Context.payload_size;
          SPI_Context.SPI_Transmit_Context.payload_size = 0;
        }
        
        SPI_Transmit_Manager(SPI_PAYLOAD_TRANSMIT);
      }
    }
    
    break;
    
  default:
    break;
  }
}

#ifdef ENABLE_SPI_FIX
/**
 * @brief  Wakeup BlueNRG
 * @param  None
 * @retval None
 */
static void WakeupBlueNRG(void)
{
  Disable_SPI_Receiving_Path();
  pTimerTxRxCallback = TimerTransmitCallback;
  set_irq_as_output();
  TIMER_Start(StartupTimerId, SPI_FIX_TIMEOUT);
  TIMER_Start(TxRxTimerId, SPI_FIX_TIMEOUT+SPI_TX_TIMEOUT);
  LPM_Mode_Request(eLPM_SPI_TX, eLPM_Mode_LP_Stop);
    
  return;
}

/**
 * @brief  Timer callback to apply timeout SPI FIX
 * @param  None
 * @retval None
 */
static void TimerStartupCallback(void)
{
  Enable_SPI_CS();
  
  return;
}

#else
/**
 * @brief  Wakeup BlueNRG
 * @param  None
 * @retval None
 */
static void WakeupBlueNRG(void)
{
  Disable_SPI_Receiving_Path();
  pTimerTxRxCallback = TimerTransmitCallback;
  Enable_SPI_CS();
  TIMER_Start(TxRxTimerId, SPI_TX_TIMEOUT);
  LPM_Mode_Request(eLPM_SPI_TX, eLPM_Mode_LP_Stop);
  
  return;
}
#endif /* ENABLE_SPI_FIX */

/**
 * @brief  Tx and Rx Transfer completed callbacks
 * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
 *               the configuration information for SPI module.
 * @retval None
 */
void BlueNRG_DMA_TxCallback(void)
{
  __HAL_DMA_CLEAR_FLAG(SPI_Context.hspi->hdmatx, BNRG_SPI_TX_DMA_TC_FLAG);
  
  switch (SPI_Context.SPI_Transmit_Context.Spi_Transmit_Event)
  {
  case SPI_HEADER_TRANSMITTED:
    if(SPI_Context.SPI_Transmit_Context.payload_size_to_transmit != 0)
    {
      SPI_Transmit_Manager(SPI_PAYLOAD_TRANSMIT);
    }
    else
    {
      TransmitClosure();
    }
    break;
    
  case SPI_PAYLOAD_TRANSMITTED:
    if( (SPI_Context.SPI_Transmit_Context.packet_cont == TRUE) && (SPI_Context.SPI_Transmit_Context.payload_size != 0))
    {
      SPI_Context.SPI_Transmit_Context.payload_data += SPI_Context.SPI_Transmit_Context.payload_size_to_transmit;
      DisableEnable_SPI_CS();
      SPI_Receive_Manager(SPI_REQUEST_VALID_HEADER_FOR_TX);
    }
    else
    {
      TransmitClosure();
    }
    break;
    
  default:
    break;
  }
  
  return;
}

/**
 * @brief  Close the transmit mechanism after packet has been sent
 *         Wait for the event to come back
 * @param  None
 * @retval None
 */
static void TransmitClosure(void)
{ 
  LPM_Mode_Request(eLPM_SPI_TX, eLPM_Mode_LP_Stop);
  SPI_Context.Spi_Peripheral_State = SPI_AVAILABLE;
  Disable_SPI_CS();
  /*
   *  Disable both DMA
   */
  __HAL_DMA_DISABLE(SPI_Context.hspi->hdmatx);
  __HAL_DMA_DISABLE(SPI_Context.hspi->hdmarx);
  Enable_SPI_Receiving_Path();
  
  return;
}

/**
 * @brief  Manage the SPI transmit
 * @param  TransmitRequest: the transmit request
 * @retval None
 */
static void SPI_Transmit_Manager(SPI_TRANSMIT_REQUEST_t TransmitRequest)
{
  /*
   *  Disable both DMA
   */
  __HAL_DMA_DISABLE(SPI_Context.hspi->hdmatx);
  __HAL_DMA_DISABLE(SPI_Context.hspi->hdmarx);
  
